tap "adoptopenjdk/openjdk"
tap "facebook/fb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage compile and link flags for libraries
brew "pkg-config"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils", link: false
# Configurable talking characters in ASCII art
brew "cowsay"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# High performance message passing library
brew "open-mpi"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Next generation open source RPC library and framework
brew "grpc"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Framework for layout and rendering of i18n text
brew "pango"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Lazier way to manage everything docker
brew "lazydocker"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql"
# Implementation of Telnet and SSH
brew "putty"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOcket CAT: netcat on steroids
brew "socat"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Terminal multiplexer
brew "tmux"
# Image processing library
brew "vips"
# 🚀 The Universal WebAssembly Runtime
brew "wasmer"
# Watch files and take action when they change
brew "watchman"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk15"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Tools for building Android applications
cask "android-studio"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Experimental peer-to-peer web browser
cask "beaker-browser"
# E-books management software
cask "calibre"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Bitcoin thin client
cask "electrum"
# Google Chromium, sans integration with Google
cask "eloston-chromium"
# Desktop debugging platform for mobile developers
cask "flipper"
cask "font-fira-code"
# Game development engine
cask "godot"
# Tools to protect your emails and files
cask "gpg-suite"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Open-source screen recorder built with web technology
cask "kap"
# Password manager app
cask "keepassxc"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Collaboration platform for API development
cask "postman"
cask "pusher"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Image viewer and file browser
cask "xee"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
